tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "dockutil"
brew "fzf"
brew "git"
brew "gnupg"
brew "grip"
brew "hub"
brew "jq"
brew "mas"
brew "nmap"
brew "pinentry-mac"
brew "shellcheck"
brew "ssh-copy-id"
brew "tealdeer"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "topgrade"
brew "zsh"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "adoptopenjdk8"
cask "android-platform-tools"
cask "appcleaner"
cask "balenaetcher"
cask "battle-net"
cask "cyberduck"
cask "discord"
cask "docker"
cask "epic-games"
cask "fork"
cask "google-chrome"
cask "microsoft-office"
cask "microsoft-teams"
cask "multimc"
cask "ngrok"
cask "onyx"
cask "packages"
cask "parsec"
cask "pgadmin4"
cask "postgres"
cask "postman"
cask "private-internet-access"
cask "rectangle"
cask "sequel-pro"
cask "steam"
cask "suspicious-package"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "Apple Remote Desktop", id: 409907375
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Wipr", id: 1320666476
