tap "caycehouse/personal", "https://github.com/caycehouse/homebrew-personal.git"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for managing dock items
brew "dockutil", link: false
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Development kit for the Java programming language
brew "openjdk"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Rsync for cloud storage
brew "rclone"
# Fast, efficient and secure backup program
brew "restic"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint", link: false
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Fixes sound quality drops when using AirPods
cask "airpods-sound-quality-fixer"
# iOS App Store alternative
cask "altserver"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Managed desktop virtualization solution
cask "citrix-workspace"
# Download and manage your addons and mods
cask "curseforge"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# Minecraft mod downloader and manager
cask "feed-the-beast"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Desktop client for GitHub repositories
cask "github"
# Game client
cask "gog-galaxy"
# Tools to protect your files
cask "gpg-suite-no-mail"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# App to manage access to corporate apps, data, and resources
cask "intune-company-portal"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Interface for reading and syncing eBooks
cask "kindle"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# GameStream client
cask "moonlight"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Open-source re-implementation of RollerCoaster Tycoon 2
cask "openrct2"
# Programmable solid 3D CAD modeller
cask "openscad"
# Play PC games and connect with your friends
cask "origin"
# Remote desktop
cask "parsec"
# Collaboration platform for API development
cask "postman"
# Minecraft launcher
cask "prismlauncher"
# Create standard or customized configuration profiles
cask "profilecreator"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Client for Old School RuneScape
cask "runelite"
# Virtual reality content platform
cask "sidequest"
# Automatically checks computer's security
cask "silentknight"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Convert 3D models into G-code instructions or PNG layers
cask "superslicer"
# Application for inspecting installer packages
cask "suspicious-package"
# Native GUI tool for relational databases
cask "tableplus"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Video communication and virtual meeting platform
cask "webex"
# Video communication and virtual meeting platform
cask "zoom-for-it-admins"
mas "1Password for Safari", id: 1569813296
mas "Apple Configurator", id: 1037126344
mas "Balance Lock", id: 1019371109
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Discovery", id: 1381004916
mas "GoodNotes", id: 1444383602
mas "HP Smart", id: 1474276998
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Remote Desktop", id: 409907375
mas "Steam Link", id: 1246969117
mas "Tailscale", id: 1475387142
mas "Termius", id: 1176074088
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
